# 3. Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку. Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо номер не містить міжнародного коду, функція автоматично додає код '+38' (для України). Це гарантує, що всі номери будуть придатними для відправлення SMS.# Функція повертає нормалізований телефонний номер у вигляді рядка.

import re
def normalize_phone(phone_number):
    cleaned_number = re.sub(r'[^\d+]', '', phone_number) # Видаляємо всі символи, крім цифр та '+'
    if cleaned_number.startswith('+'): # Перевіряємо наявність міжнародного коду
        return cleaned_number
    elif cleaned_number.startswith('380'):
        return '+' + cleaned_number
    else:
        return '+38' + cleaned_number
# Example usage
raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]
sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print(f"Нормалізовані номери телефонів для SMS-розсилки:: {sanitized_numbers}")